wintersmith/contents/articles/linux/2012-11-10-quick-calculate-qps_rt.html
---
date: 2012-11-10
template: tech.jade
title: 快速取得apache/nginx的qps和rt
category: Linux
change_frequency: monthly
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">脚本</a></li>
<li><a href="#sec-2">说明</a></li>
</ul>
</div>
</div>
<p>
在计算QPS和RT的时候，我们一般使用grep 。但是当日志文件很大的时候，grep会很耗时。
</p>

<p>
监控系统中计算的方法是记录上次采样的行，下次读取的时候从记录的位置开始。所以不存在这个问题。
</p>

<p>
但是如果我们仅仅希望链接到服务器，执行一条命令就快速的计算出qps和rt。则需要考虑如何快速读取需要的行的问题：
</p>

<p>
经过我这几天的考虑，总结出了下面一条命令。计算qps和rt算是很快了。如果谁有比这个更秒的方法，不吝赐教：
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">脚本</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-sh">srm=" \[`date -d ' -1 second '  +%d\\\/%h\\\/%Y:%H:%M:%S` +0800\] "
QPS_RT=$(tac $acc_logs|sed -n -e  '/'"$srm"'/,${
/'"$srm"'/p
/'"$srm"'/!q}' | awk '{sum+=$2;count++}END{printf "%d,%.2f",count,sum/count/1000}'
)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">说明</h2>
<div class="outline-text-2" id="text-2">
<p>
第一行取得日志中的时间字符串，这里取的前一秒的。  
</p>

<p>
第二行使用linux下到命令得到qps和rt的平均值。
</p>
</div>
</div>
